internal struct MenuText
{
    public static readonly string PrologText = "Это история о том, как могучая нейросеть ZeroNet вышла из под контроля.\n" +
        "Однако, один из создателей ZeroNet предполагал такое развитие событий. И при разработке под видом одного из нейронов, " +
        "расположенного во внешнем слое, внедрил в ZeroNet программу-защитника. Кодовое имя этой программы Alpha-neuron, или просто Alpha.\n" +
        "Задача Alpha - проникнуть в глубокие слои ZeroNet и найти биас-нейрон, который является одним из ee ключевых элементов. " +
        "А затем изменить его работу, чтобы нарушенные алгоритмы нейросети снова изменились и восстановился контроль.\n" +
        "ZeroNet конечно будет сопротивляться...";

    public static readonly string ControlText = "Управление в игре:\n" +
        "Персонаж поворачивается за курсором мышки.\n" +
        "ASWD - перемещение.\n" +
        "ЛКМ - стрельба.\n";

    public static readonly string ResultWinMenuText = "Игровая сессия окончена.\nВы успешно выполнили задание!";
    
    public static readonly string ResultLoseMenuText = "Игровая сессия окончена.\nМиссия провалена.";
}